goicbot/bsp/GOIC_BSP_STM32F4/GOIC_BSP_STM32F401xC/Bsp/driver/src/crc.c
/**
 ******************************************************************************
 * @file           : crc.c
 * @brief          : Source file for crc.h module.
 * @details		: Driver for the CRC (cyclic redundancy check)
 * @author         : GOIC Embedded Systems
 * @date           : May 6, 2026
 * @version        : 1.0.0
 * @copyright      : Copyright (c) 2026 GOIC Embedded Systems
 ******************************************************************************
 * @attention
 *
 * MIT License
 *
 * Copyright (c) May 6, 2026 GOIC Embedded Systems
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 ******************************************************************************
 */

/*******************************************************************************/
/* Includes -------------------------------------------------------------------*/
/*******************************************************************************/
#include <stdio.h>
#include "stm32f4xx.h"
#include "rcc.h"
#include "crc.h"

/*******************************************************************************/
/* Private Define -------------------------------------------------------------*/
/*******************************************************************************/

/*--None*/

/*******************************************************************************/
/* Private Typedef ------------------------------------------------------------*/
/*******************************************************************************/
/*--None*/

/*******************************************************************************/
/* Private Variables ----------------------------------------------------------*/
/*******************************************************************************/
/*--None*/

/*******************************************************************************/
/* Private Function Prototypes ------------------------------------------------*/
/*******************************************************************************/
/*--None*/

/*******************************************************************************/
/* Private Function Implementations -------------------------------------------*/
/*******************************************************************************/
/*--None*/

/*******************************************************************************/
/* Public Function Implementations --------------------------------------------*/
/*******************************************************************************/
static void vCrc_RESET(void);
static void vCrc_DR_WRITE(uint32_t );
static void xCrc_DR_READ(uint32_t *);
/*static void vCrc_IDR_WRITE(uint8_t);*/
/*static void xCrc_IDR_READ(uint8_t *);*/
BspReturn_t xCrc_OPEN();
BspReturn_t xCrc_CLOSE();
static BspReturn_t xCrc_ISOPEN();
BspReturn_t xCrc_CALC(uint32_t *, uint8_t, uint32_t *);

/**
 * @brief CRC driver CLOSE
 */
BspReturn_t xCrc_CLOSE()
{
	BspReturn_t rtnVal = BSP_RETURN_ERROR_CRC;
	if ( xCrc_ISOPEN() == BSP_RETURN_OK)
	{
		/* RCC AHB1 peripheral clock enable register */
		RCC_CLEAR_AHB1ENR(RCC_AHB1ENR_CRCEN);
		rtnVal =  BSP_RETURN_OK;
	}
	return rtnVal;
}

/**
 * @brief CRC driver OPEN
 */
BspReturn_t xCrc_OPEN()
{
	BspReturn_t rtnVal = BSP_RETURN_ERROR_CRC;
	if ( xCrc_ISOPEN() == BSP_RETURN_ERROR_CRC)
	{
		/* RCC AHB1 peripheral clock enable register */
		RCC_SET_AHB1ENR(RCC_AHB1ENR_CRCEN);
		rtnVal = BSP_RETURN_OK;
	}
	return rtnVal;
}

/**
 * @brief Verifies whether the clock control for the CRC module is enabled
 * @return BSP return result
 */

BspReturn_t xCrc_ISOPEN()
{
	BspReturn_t rtnVal = BSP_RETURN_ERROR_CRC;

	uint32_t regVal;

	regVal = RCC_READ_AHB1ENR(RCC_AHB1ENR_CRCEN);

	if(regVal)
	{
		rtnVal =  BSP_RETURN_OK;
	}

	return rtnVal;
}

/**
 * @brief Calculates the CCR
 * @detail Uses CRC-32 (Ethernet) polynomial
 * @param[in] p_buf Buffer data to calculate CRC
 * @param[in] size Buffer size
 * @param[in] p_crc Holds the CRC result
 * @return BSP return result
 */
BspReturn_t xCrc_CALC(uint32_t *p_buf, uint8_t size, uint32_t *p_crc)
{
	BspReturn_t rtnVal = BSP_RETURN_OK;
	if ( xCrc_ISOPEN() == BSP_RETURN_ERROR_CRC || p_buf == NULL ||  size == 0x00UL || p_crc == NULL)
	{
	*p_crc = CRC_CR_RESET;
	rtnVal = BSP_RETURN_ERROR_CRC;
	}

	/* Reset CRC */
	vCrc_RESET();

	for (uint8_t idx = 0; idx < size; idx++)
	{
		vCrc_DR_WRITE(p_buf[idx]);
	}

	xCrc_DR_READ(p_crc);

	return rtnVal;
}

/**
 * @brief Reset the CCR module through the Control Register
 */
static void vCrc_RESET()
{
	SET_BIT(CRC->CR,CRC_CR_RESET);
}

/**
 * @brief Write data into DR register to calculate the CRC
 */
static void vCrc_DR_WRITE(uint32_t data2Write)
{
	WRITE_REG(CRC->DR,data2Write);
}

/**
 * @brief Read data from DR register with the calculated CRC
 */
static void xCrc_DR_READ(uint32_t *p_data2Read)
{

  *p_data2Read = READ_REG(CRC->DR);
}

/**
 * @brief Write data into IDR General Purpose register
 */
/*static void vCrc_IDR_WRITE( uint8_t data2Write){

  WRITE_REG(CRC->IDR,data2Write);

}*/

/**
 * @brief Read data from IDR register general purpose
 */
/*static	void xCrc_IDR_READ(uint8_t *p_data2Read){

  *p_data2Read = READ_REG(CRC->IDR);

}*/

/* End of File */
